; ------------------------------------------------------------------------------
;	リンクのテスト 
; ------------------------------------------------------------------------------

	; --------------------------------------------
	; 呼んでる「前」に宣言があるケース
	link	sub1
sub1:
			ld	a, 1
			ret
	endl

	call	sub1

	; --------------------------------------------
	call	sub2

	; 呼んでる「後」に宣言があるケース
	link	sub2
sub2:
			ld	a, 2
			ret
	endl

	; --------------------------------------------
	; 呼ばれないケース
	link	sub3
sub3:
			ld	a, 3
			ret
	endl

	; 呼ばれない LINK の後に別のコードがある
	ld		hl, 0x1234

	; --------------------------------------------
	; 複数のトリガー名が存在するケース
	link	sub4_1, sub4_2
sub4_1:
			ld	a, 4
sub4_2:
			ret
	endl

	call	sub4_2
